sourcehold-rails/app/controllers/home_controller.rb

  def index
    if(user_signed_in?)
      redirect_to :dashboard
    end

    @blog_posts = BlogPost.order("created_at DESC").limit(5)
---
SELECT "blog_posts".* FROM "blog_posts" ORDER BY created_at DESC LIMIT 5